; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v10)
             (pred_5 ?v2 ?v13)
             (pred_1 ?v7 ?v13)
             (pred_2 ?v11 ?v7 )
	     (pred_11 ?v7)
             (pred_6 ?v9)
             (pred_4 ?v2)
             (pred_3 ?v13)
             (pred_8 ?v7)
             (pred_12 ?v2)
             (pred_7 ?v7)
             (pred_9 ))



(:action op_5
:parameters (?v3 ?v4 ?v8 ?v5)
:precondition (and (pred_6 ?v3) (pred_6 ?v4) (pred_4 ?v8) (pred_3 ?v5)
          (pred_10 ?v3 ?v4) (pred_5 ?v8 ?v5)
                   (pred_1 ?v4 ?v5) (pred_11 ?v3) 
                   (pred_8 ?v4) (pred_12 ?v8))
:effect (and  (pred_7 ?v4) (not (pred_8 ?v4))))


(:action op_3
:parameters (?v3 ?v12)
:precondition (and (pred_6 ?v3) (pred_6 ?v12)
               (pred_11 ?v3) (pred_10 ?v3 ?v12) (pred_7 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v3))))

(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_6 ?v3) (pred_4 ?v8) 
                  (pred_11 ?v3) (pred_2 ?v8 ?v3) (pred_9 ))
:effect (and (pred_12 ?v8)
   (not (pred_2 ?v8 ?v3)) (not (pred_9 ))))


(:action op_1
:parameters (?v3 ?v6 ?v1)
:precondition (and (pred_6 ?v3) (pred_4 ?v6) (pred_4 ?v1)
                  (pred_11 ?v3) (pred_12 ?v1) (pred_2 ?v6 ?v3))
:effect (and (pred_12 ?v6) (pred_2 ?v1 ?v3)
        (not (pred_12 ?v1)) (not (pred_2 ?v6 ?v3))))

(:action op_2
:parameters (?v3 ?v8)
:precondition (and (pred_6 ?v3) (pred_4 ?v8) 
                  (pred_11 ?v3) (pred_12 ?v8))
:effect (and (pred_9 ) (pred_2 ?v8 ?v3) (not (pred_12 ?v8)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_02 obj_10 obj_13 obj_03 obj_07 obj_06 obj_09 obj_12
    obj_08 obj_04
    obj_05 obj_11
    )

    (:init
       (pred_9)

       (pred_6 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_13)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_09)
       (pred_6 obj_12)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_11)

       (pred_10 obj_01 obj_13)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_09)
       (pred_8 obj_09)
       (pred_8 obj_12)
       (pred_1  obj_09 obj_08)
       (pred_1  obj_12 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_06)

       (pred_5  obj_05 obj_08)
       (pred_5  obj_11 obj_04)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_11 obj_07)
       (pred_11 obj_10)
    )

    (:goal (and
       (pred_2 obj_11 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_3 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_11)
   deleted: (pred_2 obj_11 obj_07) (pred_9)
   added: (pred_12 obj_11)
   goals met: 0 of 1
3. (op_3 obj_07 obj_10)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_3 obj_10 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_02)
   goals met: 0 of 1
5. (op_3 obj_02 obj_01)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_01)
   goals met: 0 of 1
6. (op_3 obj_01 obj_13)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_2 obj_06 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_9) (pred_2 obj_11 obj_06)
   goals met: 1 of 1
